In [2]:
import pandas as pd

Q1. Create a DataFrame containing student information like Name, Age, Department, %Marks
Display column names of the DF
Show min/max and average marks
Get unique values and student count for each Department

In [6]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva","Mrugank","Vedant"],
    "Age": [20, 21, 19, 22, 20, 22, 22],
    "Department": ["Computer Science", "Mathematics", "Physics", "Mathematics", "Physics", "Mathematics", "Mathematics"],
    "Marks": [88, 92, 85, 78, 90, 95, 100]
}
df = pd.DataFrame(data)
df

      Name  Age        Department  Marks
0    Alice   20  Computer Science     88
1      Bob   21       Mathematics     92
2  Charlie   19           Physics     85
3    David   22       Mathematics     78
4      Eva   20           Physics     90
5  Mrugank   22       Mathematics     95
6   Vedant   22       Mathematics    100

In [7]:
df.describe()

             Age       Marks
count   7.000000    7.000000
mean   20.857143   89.714286
std     1.214986    7.087884
min    19.000000   78.000000
25%    20.000000   86.500000
50%    21.000000   90.000000
75%    22.000000   93.500000
max    22.000000  100.000000

In [9]:
min_marks = df["Marks"].min()
max_marks = df["Marks"].max()
avg_marks = df["Marks"].mean()

In [11]:
print(min_marks)
print(max_marks)
print(avg_marks)

78
100
89.71428571428571

In [12]:
unique_departments = df["Department"].unique()
unique_departments

array(['Computer Science', 'Mathematics', 'Physics'], dtype=object)

In [13]:
student_count_per_dept = df["Department"].value_counts()
student_count_per_dept

Department
Mathematics         4
Physics             2
Computer Science    1
Name: count, dtype: int64


Q2. Read csv file solar.csv

Display all the plants with capacity > 500 MW

Display plant details for New York plant

For all the plants display Average MW Per Plant and Generation (GWh)

Sort the plants by Generation (GWh) (ascending) and Installed Capacity (MW)(descending)

List top 5 plants for their Generation

Display all plant details for states – California, Nevada, Arizona and Texas

Group the plants by region, find – min/max capacity plant for each group

Add following information to the existing details for the plants

In [33]:
data = pd.read_csv("solar.csv")
data

,State,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
0,California,289,4395,15.3,10826,West
1,Arizona,48,1078,22.5,2550,West
2,Nevada,11,238,21.6,557,West
3,Chicago,33,261,7.9,590,North
4,Connecticut,20,118,5.9,235,East
5,Texas,12,187,15.6,354,South
6,New York,13,53,4.1,84,East
7,Florida,15,535,12.3,453,South

In [45]:
data = data.set_index("State")

In [49]:
data

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Arizona,48,1078,22.5,2550,West
Nevada,11,238,21.6,557,West
Chicago,33,261,7.9,590,North
Connecticut,20,118,5.9,235,East
Texas,12,187,15.6,354,South
New York,13,53,4.1,84,East
Florida,15,535,12.3,453,South

In [46]:
data.count()

Number of Solar Plants     8
Installed Capacity (MW)    8
Average MW Per Plant       8
Generation (GWh)           8
Region                     8
dtype: int64

In [47]:
d1 = data['Installed Capacity (MW)'] > 500
data[d1]

,Number of Solar Plants,Installed Capacity (MW),Average MW Per Plant,Generation (GWh),Region
State,,,,,
California,289,4395,15.3,10826,West
Arizona,48,1078,22.5,2550,West
Florida,15,535,12.3,453,South

In [53]:
data.loc['New York']

Number of Solar Plants       13
Installed Capacity (MW)      53
Average MW Per Plant        4.1
Generation (GWh)             84
Region                     East
Name: New York, dtype: object

In [77]:
# d2 = data["Average MW Per Plant", "Generation (GWh)"]
# data[d2]
d2 = data[["Average MW Per Plant", "Generation (GWh)"]]
print(d2)

             Average MW Per Plant  Generation (GWh)
State
California                   15.3             10826
Arizona                      22.5              2550
Nevada                       21.6               557
Chicago                       7.9               590
Connecticut                   5.9               235
Texas                        15.6               354
New York                      4.1                84
Florida                      12.3               453

In [ ]:
# Sort the plants by Generation (GWh) (ascending) and Installed Capacity (MW)(descending)